r-v4-5bd2394873618/taurus-custom-config.yml
execution:
    -
        concurrency: 20
        steps: 0
        locations:
            us-east-1: 20
        locationsPercents:
            us-east-1: 100
        executor: jmeter
        scenario: default-scenario-6382363
        hold-for: 2m
        ramp-up: 3m
services:
    -
        module: s3downloader
        aws-params: { region: us-east-1, bucket-name: blazemeter, data-path: users/407077/tests/6382363/reports/r-v4-5bd2394873618/data, key-id: ASIA27ZZ6HCKWQVR45EH, secret: dTiOxelsuPGV/YwlfpZga8bGn2a8Vq3MFcrMR/ES, token: FQoGZXIvYXdzEB8aDI3C4vUsSz+JMqJUWCLkAwFnwoBICBleL2flZ1sVW9YCEO6ZpVGLBXH9YoGpGiUsycqB8VXe7WVHqmUUvNp/pOGrZF9123erSgAQf8pPDL67sAxycu0ROSoxfDbamnQ5Kv8FSMjFcLQ7ZcZb+QmQPYSqA/6DZV12eQkA+aq7low/K4aKSUsO0c5D9W8Ts0+l6SOD6pXdbkP1ThqbcqyVzKaqmnwVhZFPZtl9/P35GB58TZjq1DHkV+GvGhAbkQtNdijvF8s0qa8x6D/kZDRLbwUSPiASeyuqbpIkT08GmtFSgZCJ5sTAw3yOXPOy4o0baf0z2pMoGqcjkwikCCzDWoMt+ik+CT9IGa1eAx5opU8trjJ6uocs2b580mBTaZlX2NE93fUx3Rvm5+pn1JkRQS5qGyFbaZqHoFJb5GZb9wVfWq+m8w4YrXxyq3z9GFG/m+Kwu9OzlQcPdSWvAyvuvQnkK3Uq5b5IpNr6ajOeytgqLJGDvNZdTqgdcKXP9QAqKCH1N3i+kaY0kZEcotIMW4XXyV++uN3n3DrmbF51GkkXlm8s9azxdH6P/ufrqJ8M60i+8n9GiqwGQmGRRuSdMD/hnBYNLg5HvRXIlcQSnSbdZS1/8uA9XWQpASXToYdxxx1yLIGFV6J1lyWNZ0Axz3QrDjYo9PLI3gU=, url: 's3://blazemeter/users/407077/tests/6382363/reports/r-v4-5bd2394873618/' }
scenarios:
    default-scenario-6382363:
        script: NOP_SC2.jmx
        force-parent-sample: false
settings:
    env:
        TAURUS_EXECUTIONS_TOTAL: 1
        TAURUS_EXECUTIONS_INDEX: 1
        TAURUS_SESSIONS_TOTAL: 1
        TAURUS_SESSIONS_INDEX: 1
        TAURUS_LOCATIONS_TOTAL: 1
        TAURUS_LOCATIONS_INDEX: 1
modules:
    jmeter:
        version: auto
    cloud-utils:
        session:
            signature: ci12NC01YmQyMzk0ODczNjE4OjE1NDE3MTM1MjQ6NTk0YjQ2ZThjMzg2ZTllYmMwOTdkN2YyN2YyNmY1ZmRiNTg2NWZlMGRhMTRlMzEzNDg4OTlhZGJlOTNkMjZkOWVhNzZlMzEzODgwM2ExZjI4M2RiNmU4N2VhMGE4YTM3ZmQ2ZThlMTA1MzlhZWE0NzBkMjU4MTVlNzUyNTIwM2Q=
            session_id: r-v4-5bd2394873618
            master_id: !!float 18436481
            user_id: 407077
            test_id: 6382363
            session_token: ci12NC01YmQyMzk0ODczNjE4OjE1NDE3MTM1MjQ6NTk0YjQ2ZThjMzg2ZTllYmMwOTdkN2YyN2YyNmY1ZmRiNTg2NWZlMGRhMTRlMzEzNDg4OTlhZGJlOTNkMjZkOWVhNzZlMzEzODgwM2ExZjI4M2RiNmU4N2VhMGE4YTM3ZmQ2ZThlMTA1MzlhZWE0NzBkMjU4MTVlNzUyNTIwM2Q=
        jetlag-url: 'https://data.blazemeter.com/submit.php?signature={signature}&session_id={session_id}&user_id={user_id}&test_id={test_id}'
        jetlag-download: 'https://s3.amazonaws.com/blazemeter-jetlag/snapshots/jetlag-1.6.6-2018-08-12-14-47-jar-with-dependencies.jar'
        jetlag-args: '-max_labels 100'
        aws-params: { region: us-east-1, bucket-name: blazemeter, data-path: users/407077/tests/6382363/reports/r-v4-5bd2394873618/data, key-id: ASIA27ZZ6HCKWQVR45EH, secret: dTiOxelsuPGV/YwlfpZga8bGn2a8Vq3MFcrMR/ES, token: FQoGZXIvYXdzEB8aDI3C4vUsSz+JMqJUWCLkAwFnwoBICBleL2flZ1sVW9YCEO6ZpVGLBXH9YoGpGiUsycqB8VXe7WVHqmUUvNp/pOGrZF9123erSgAQf8pPDL67sAxycu0ROSoxfDbamnQ5Kv8FSMjFcLQ7ZcZb+QmQPYSqA/6DZV12eQkA+aq7low/K4aKSUsO0c5D9W8Ts0+l6SOD6pXdbkP1ThqbcqyVzKaqmnwVhZFPZtl9/P35GB58TZjq1DHkV+GvGhAbkQtNdijvF8s0qa8x6D/kZDRLbwUSPiASeyuqbpIkT08GmtFSgZCJ5sTAw3yOXPOy4o0baf0z2pMoGqcjkwikCCzDWoMt+ik+CT9IGa1eAx5opU8trjJ6uocs2b580mBTaZlX2NE93fUx3Rvm5+pn1JkRQS5qGyFbaZqHoFJb5GZb9wVfWq+m8w4YrXxyq3z9GFG/m+Kwu9OzlQcPdSWvAyvuvQnkK3Uq5b5IpNr6ajOeytgqLJGDvNZdTqgdcKXP9QAqKCH1N3i+kaY0kZEcotIMW4XXyV++uN3n3DrmbF51GkkXlm8s9azxdH6P/ufrqJ8M60i+8n9GiqwGQmGRRuSdMD/hnBYNLg5HvRXIlcQSnSbdZS1/8uA9XWQpASXToYdxxx1yLIGFV6J1lyWNZ0Axz3QrDjYo9PLI3gU=, url: 's3://blazemeter/users/407077/tests/6382363/reports/r-v4-5bd2394873618/' }
        start-allow-limit: 1ms
        start-limit-exceeded-shutdown: false
        delayed-start: false
        sleep-after: 0
        status-notify-url: 'https://a.blazemeter.com/api/v4/taurus/r-v4-5bd2394873618/notify'
        session-token: ci12NC01YmQyMzk0ODczNjE4OjE1NDE3MTM1MjQ6NTk0YjQ2ZThjMzg2ZTllYmMwOTdkN2YyN2YyNmY1ZmRiNTg2NWZlMGRhMTRlMzEzNDg4OTlhZGJlOTNkMjZkOWVhNzZlMzEzODgwM2ExZjI4M2RiNmU4N2VhMGE4YTM3ZmQ2ZThlMTA1MzlhZWE0NzBkMjU4MTVlNzUyNTIwM2Q=
        commands-channel:
            url: 'https://a.blazemeter.com/api/v4/taurus/{session_id}/poll'
    blazemeter:
        address: 'https://a.blazemeter.com'
        data-address: 'https://data.blazemeter.com'
    periodic-uploader:
        enabled: true
        upload_interval: 60
    version-switch:
        switch-java: '8'
    passfail:
        class: bzt.engine.Reporter
reporting:
    -
        module: blazemeter
        session-id: r-v4-5bd2394873618
        signature: ci12NC01YmQyMzk0ODczNjE4OjE1NDE3MTM1MjQ6NTk0YjQ2ZThjMzg2ZTllYmMwOTdkN2YyN2YyNmY1ZmRiNTg2NWZlMGRhMTRlMzEzNDg4OTlhZGJlOTNkMjZkOWVhNzZlMzEzODgwM2ExZjI4M2RiNmU4N2VhMGE4YTM3ZmQ2ZThlMTA1MzlhZWE0NzBkMjU4MTVlNzUyNTIwM2Q=
        send-data: false
        upload-artifacts: false
        test-id: 6382363
        user-id: 407077